InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСогласований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Приоритеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Приоритеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусПриоритета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыСтатус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтадииКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Стадия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	КоличествоОбъектов = ЭтотОбъект.Количество();
	
	Если ЭтотОбъект.Количество() = 1 Тогда
	
		мКомплектов = ЭтотОбъект[0].Комплект;	
	
	Иначе
		
		мКомплектов = Новый Массив(ЭтотОбъект.Количество());
		Индекс = 0;
		
		Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
			
			мКомплектов[Индекс] = ТекущаяЗапись.Комплект; 
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
	|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
	|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект
	|ИЗ
	|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&мКомплектов)) КАК ДанныеКомплектаСрезПоследних
	|ГДЕ
	|	НЕ ДанныеКомплектаСрезПоследних.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("мКомплектов", мКомплектов);
	
	тзПриоритеты = Запрос.Выполнить().Выгрузить(); 
	
	Если тзПриоритеты.Количество() > 0 Тогда
	
		КонтрольСнятияПриоритетов(тзПриоритеты, мКомплектов);	
	
	КонецЕсли;
	
КонецПроцедуры


Процедура КонтрольСнятияПриоритетов(тзПриоритеты, мКомплектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриоритетыСтадииКомплекта.Стадия КАК Стадия,
		|	ПриоритетыСтадииКомплекта.Ссылка КАК Приоритет
		|ИЗ
		|	Справочник.Приоритеты.СтадииКомплекта КАК ПриоритетыСтадииКомплекта
		|ГДЕ
		|	ПриоритетыСтадииКомплекта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", омТЧ_НаКлиентеСервере.КолонкуВМассив(тзПриоритеты,"Приоритет"));
	
	тзСтадииПриоритетов = Запрос.Выполнить().Выгрузить(); 
	тзСтадииПриоритетов.Индексы.Добавить("Приоритет, Стадия");
	
	стОтбор = Новый Структура("Приоритет, Стадия", );
	
	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущаяЗапись.Приоритет) Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		стОтбор.Приоритет 	= ТекущаяЗапись.Приоритет;
		стОтбор.Стадия 		= ТекущаяЗапись.ТекущаяСтадия;
		
		НайденыеСтроки = тзСтадииПриоритетов.НайтиСтроки(стОтбор);
		
		ОчиситьСтатус = Истина;
		
		Для каждого текПриоритет Из НайденыеСтроки Цикл
			ОчиситьСтатус = Ложь;	
		КонецЦикла;
		
		Если ОчиситьСтатус Тогда
		
			ТекущаяЗапись.Приоритет = Справочники.Приоритеты.ПустаяСсылка();	
		
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры
